Revit 2027 API
AnalyticalMember.StructuralSectionShape Property
 The structural section shape of the Analytical Member.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public StructuralSectionShape StructuralSectionShape { get; }
Public ReadOnly Property StructuralSectionShape As StructuralSectionShape
	Get
public:
property StructuralSectionShape StructuralSectionShape {
	StructuralSectionShape get ();
}
member StructuralSectionShape : StructuralSectionShape with get
Property Value
StructuralSectionShape
See Also
Reference
AnalyticalMember Class
Autodesk.Revit.DB.Structure Namespace